using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lab5 ktp
{
    internal class Program
    {
        static void Main(string[] args)
        {

            Console.OutputEncoding = System.Text.Encoding.UTF8;

            // текстова інформація
            Console.WriteLine("Лабораторна робота №5\nТема роботи: Оператори циклу. Цикли for та while\n");
            Console.WriteLine("Варіант №32\nСкласти програму для обчислення факторіала натурального числа, яке вводиться з клавіатури.");
            Console.WriteLine("Виконав студент БІП1-25\nЧерниченко Кирило\n");

            Console.WriteLine("* Підказка: натуральні числа - це всі числа від 1\n");

            Console.WriteLine("------------ початок розрахунку --------------\n");

            while (true) // цикл while (true) виконується весь час до команди break
            {
                Console.Write("Введіть число: ");
                long chyslo5 = Convert.ToInt64(Console.ReadLine()); // конвертуємо введення інформації у тип long

                if (chyslo5 <= 0) // натуральне число може бути тільки > 0, тобто від 1
                {
                    Console.WriteLine("[Помилка] Потрібно ввести натуральне число (тобто > 0).\n");
                }

                else if (chyslo5 > 20) // перевірка для обжмення великочого значення поза діапазоном значення типу long
                {
                    Console.WriteLine("[Помилка] Ви ввели занадто ввелике число для розрахування факторіалу із типом даних 'long'\nМаксимальний діапазон значень long від -9223372036854775808 до 9223372036854775807\nНаприклад результат 21! = 51090942171709440000, що є більше максимального діапазону, тому результат обрахунку буде неправильним\n");
                }
                else
                {
                    long faktorial = 1; // задаємо 1 тому найменший факторів 1! = 1
                    string rozvyazok = ""; // задаємо пустий рядок для циклу, тому що значення буде додаватись до поточного рядка, це буде розв'язок у текстовому форматі

                    for (long t = 1; t <= chyslo5; t++) // цикл для розрахунку факторіалу, використано for тому що ми знаємо кількість повторень
                    {
                        faktorial *= t;
                        rozvyazok += (t == chyslo5) ? $"{t}" : $"{t} * "; // виводимо всі числа із циклу у вигляді розв'язку 
                                                                          // тернарний оператор правопис "умова ? значення_якщо_істина : значення_якщо_неістина;"
                    }

                    // виведення розрахунку та результату
                    Console.WriteLine($"Розрахунок факторіалу числа: {chyslo5}\n");
                    Console.WriteLine($"Результат обрахунку {chyslo5}! = {rozvyazok} = {faktorial}");
                    Console.WriteLine("\n------------ кінець розрахунку --------------\n");

                    // запуск повторного розрахунку
                    Console.WriteLine("Потрібно розрахувати факторіал нового числа?");
                    Console.WriteLine("1 = Так / Інше значення = Ні");
                    Console.Write("Введіть команду: ");
                    string restart = Console.ReadLine();

                    if (restart == "1")
                    {
                        Console.WriteLine("\n------------ початок нового розрахунку --------------\n");
                        continue; // запускаємо цикл знову для нового розрахунку
                    }
                    else
                    {
                        Console.WriteLine("\n------------ програму можете закрити --------------");
                        break; // виходимо з циклу, тобто кінець програми якщо ми ввели не 1
                    }

                }

            }





        }
    }
}